{"class_name": "ThinModel", "backend": "tensorflow", "config": {"name": "thin_model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32"}}, {"name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 32, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3, 3], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv1", "activity_regularizer": null, "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"name": "conv1_bn", "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv1_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv1_relu", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv1_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_1", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_1", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_1_bn", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_1_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_1_relu", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_1_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_1", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 64, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_1", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_1_bn", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_1_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_1_relu", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_1_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_2", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_2", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"name": "conv_dw_2_bn", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_2_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_2_relu", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_2_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_2", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_2", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_2_bn", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_2_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_2_relu", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_2_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_3", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_3", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_3_bn", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_3_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_3_relu", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_3_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_3", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 128, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_3", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_3_bn", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_3_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_3_relu", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_3_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_4", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_4", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"name": "conv_dw_4_bn", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_4_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_4_relu", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_4_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_4", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_4", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_4_bn", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_4_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_4_relu", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_4_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_5", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_5", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_5_bn", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_5_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_5_relu", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_5_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_5", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 256, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_5", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_5_bn", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_5_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_5_relu", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_5_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_6", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_6", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"name": "conv_dw_6_bn", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_6_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_6_relu", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_6_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_6", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_6", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_6_bn", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_6_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_6_relu", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_6_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_7", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_7", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_7_bn", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_7_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_7_relu", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_7_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_7", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_7", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_7_bn", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_7_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_7_relu", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_7_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_8", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_8", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_8_bn", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_8_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_8_relu", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_8_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_8", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_8", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_8_bn", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_8_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_8_relu", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_8_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_9", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_9", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_9_bn", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_9_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_9_relu", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_9_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_9", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_9", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_9_bn", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_9_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_9_relu", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_9_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_10", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_10", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_10_bn", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_10_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_10_relu", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_10_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_10", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_10", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_10_bn", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_10_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_10_relu", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_10_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_11", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_11", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_11_bn", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_11_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_11_relu", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_11_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_11", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 512, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_11", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_11_bn", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_11_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_11_relu", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_11_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_12", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_12", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"name": "conv_dw_12_bn", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_12_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_12_relu", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_12_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_12", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 1024, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_12", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_12_bn", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_12_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_12_relu", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_12_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_dw_13", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"padding": "same", "use_bias": false, "depthwise_constraint": null, "depthwise_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "kernel_size": [3, 3], "name": "conv_dw_13", "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "depth_multiplier": 1, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_dw_13_bn", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_dw_13_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_dw_13_relu", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_dw_13_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "conv_pw_13", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": false, "kernel_regularizer": null, "filters": 1024, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_pw_13", "activity_regularizer": null, "trainable": false, "strides": [1, 1], "dtype": "float32"}}, {"name": "conv_pw_13_bn", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "center": true, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true, "axis": [3], "beta_regularizer": null, "epsilon": 0.001, "name": "conv_pw_13_bn", "trainable": false, "dtype": "float32"}}, {"name": "conv_pw_13_relu", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "conv_pw_13_relu", "dtype": "float32", "trainable": false, "activation": "relu6"}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"name": "reshape_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [1, 1, 1024], "trainable": true, "dtype": "float32"}}, {"name": "dropout", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout", "noise_shape": null, "rate": 0.001, "trainable": true, "seed": null, "dtype": "float32"}}, {"name": "conv_preds", "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Conv2D", "config": {"use_bias": true, "kernel_regularizer": null, "filters": 3, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_size": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "name": "conv_preds", "activity_regularizer": null, "trainable": true, "strides": [1, 1], "dtype": "float32"}}, {"name": "act_softmax", "inbound_nodes": [[["conv_preds", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "act_softmax", "dtype": "float32", "trainable": true, "activation": "softmax"}}, {"name": "reshape_2", "inbound_nodes": [[["act_softmax", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_2", "target_shape": [3], "trainable": true, "dtype": "float32"}}], "output_layers": [["reshape_2", 0, 0]]}, "keras_version": "2.1.4-tf"}