{"class_name": "ThinModel", "config": {"input_layers": [["input_1", 0, 0]], "name": "thin_model_1", "output_layers": [["predictions", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": false, "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "name": "block1_conv1"}, "name": "block1_conv1"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block1_conv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block1_conv1_bn"}, {"inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block1_conv1_act", "dtype": "float32"}, "name": "block1_conv1_act"}, {"inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": false, "kernel_regularizer": null, "padding": "valid", "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "name": "block1_conv2"}, "name": "block1_conv2"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block1_conv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block1_conv2_bn"}, {"inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block1_conv2_act", "dtype": "float32"}, "name": "block1_conv2_act"}, {"inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 128, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block2_sepconv1"}, "name": "block2_sepconv1"}, {"inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block2_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block2_sepconv1_bn"}, {"inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block2_sepconv2_act", "dtype": "float32"}, "name": "block2_sepconv2_act"}, {"inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 128, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block2_sepconv2"}, "name": "block2_sepconv2"}, {"inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block2_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block2_sepconv2_bn"}, {"inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": false, "kernel_regularizer": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_1"}, "name": "conv2d_1"}, {"inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "padding": "same", "dtype": "float32", "trainable": false, "name": "block2_pool", "data_format": "channels_last"}, "name": "block2_pool"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_1", "dtype": "float32"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block3_sepconv1_act", "dtype": "float32"}, "name": "block3_sepconv1_act"}, {"inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 256, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block3_sepconv1"}, "name": "block3_sepconv1"}, {"inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block3_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block3_sepconv1_bn"}, {"inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block3_sepconv2_act", "dtype": "float32"}, "name": "block3_sepconv2_act"}, {"inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 256, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block3_sepconv2"}, "name": "block3_sepconv2"}, {"inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block3_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block3_sepconv2_bn"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": false, "kernel_regularizer": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 256, "name": "conv2d_2"}, "name": "conv2d_2"}, {"inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "padding": "same", "dtype": "float32", "trainable": false, "name": "block3_pool", "data_format": "channels_last"}, "name": "block3_pool"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_2", "dtype": "float32"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block4_sepconv1_act", "dtype": "float32"}, "name": "block4_sepconv1_act"}, {"inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block4_sepconv1"}, "name": "block4_sepconv1"}, {"inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block4_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block4_sepconv1_bn"}, {"inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block4_sepconv2_act", "dtype": "float32"}, "name": "block4_sepconv2_act"}, {"inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block4_sepconv2"}, "name": "block4_sepconv2"}, {"inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block4_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block4_sepconv2_bn"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": false, "kernel_regularizer": null, "padding": "same", "dtype": "float32", "activity_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "activation": "linear", "kernel_size": [1, 1], "dilation_rate": [1, 1], "filters": 728, "name": "conv2d_3"}, "name": "conv2d_3"}, {"inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "strides": [2, 2], "padding": "same", "dtype": "float32", "trainable": false, "name": "block4_pool", "data_format": "channels_last"}, "name": "block4_pool"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_3", "dtype": "float32"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block5_sepconv1_act", "dtype": "float32"}, "name": "block5_sepconv1_act"}, {"inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block5_sepconv1"}, "name": "block5_sepconv1"}, {"inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block5_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block5_sepconv1_bn"}, {"inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block5_sepconv2_act", "dtype": "float32"}, "name": "block5_sepconv2_act"}, {"inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block5_sepconv2"}, "name": "block5_sepconv2"}, {"inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block5_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block5_sepconv2_bn"}, {"inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block5_sepconv3_act", "dtype": "float32"}, "name": "block5_sepconv3_act"}, {"inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block5_sepconv3"}, "name": "block5_sepconv3"}, {"inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block5_sepconv3_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block5_sepconv3_bn"}, {"inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_4", "dtype": "float32"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block6_sepconv1_act", "dtype": "float32"}, "name": "block6_sepconv1_act"}, {"inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block6_sepconv1"}, "name": "block6_sepconv1"}, {"inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block6_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block6_sepconv1_bn"}, {"inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block6_sepconv2_act", "dtype": "float32"}, "name": "block6_sepconv2_act"}, {"inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block6_sepconv2"}, "name": "block6_sepconv2"}, {"inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block6_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block6_sepconv2_bn"}, {"inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block6_sepconv3_act", "dtype": "float32"}, "name": "block6_sepconv3_act"}, {"inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block6_sepconv3"}, "name": "block6_sepconv3"}, {"inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block6_sepconv3_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block6_sepconv3_bn"}, {"inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_5", "dtype": "float32"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block7_sepconv1_act", "dtype": "float32"}, "name": "block7_sepconv1_act"}, {"inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block7_sepconv1"}, "name": "block7_sepconv1"}, {"inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block7_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block7_sepconv1_bn"}, {"inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block7_sepconv2_act", "dtype": "float32"}, "name": "block7_sepconv2_act"}, {"inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block7_sepconv2"}, "name": "block7_sepconv2"}, {"inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block7_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block7_sepconv2_bn"}, {"inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block7_sepconv3_act", "dtype": "float32"}, "name": "block7_sepconv3_act"}, {"inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block7_sepconv3"}, "name": "block7_sepconv3"}, {"inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block7_sepconv3_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block7_sepconv3_bn"}, {"inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_6", "dtype": "float32"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block8_sepconv1_act", "dtype": "float32"}, "name": "block8_sepconv1_act"}, {"inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block8_sepconv1"}, "name": "block8_sepconv1"}, {"inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block8_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block8_sepconv1_bn"}, {"inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block8_sepconv2_act", "dtype": "float32"}, "name": "block8_sepconv2_act"}, {"inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block8_sepconv2"}, "name": "block8_sepconv2"}, {"inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block8_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block8_sepconv2_bn"}, {"inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block8_sepconv3_act", "dtype": "float32"}, "name": "block8_sepconv3_act"}, {"inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block8_sepconv3"}, "name": "block8_sepconv3"}, {"inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block8_sepconv3_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block8_sepconv3_bn"}, {"inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": false, "name": "add_7", "dtype": "float32"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block9_sepconv1_act", "dtype": "float32"}, "name": "block9_sepconv1_act"}, {"inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block9_sepconv1"}, "name": "block9_sepconv1"}, {"inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block9_sepconv1_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block9_sepconv1_bn"}, {"inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block9_sepconv2_act", "dtype": "float32"}, "name": "block9_sepconv2_act"}, {"inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block9_sepconv2"}, "name": "block9_sepconv2"}, {"inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block9_sepconv2_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": "block9_sepconv2_bn"}, {"inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": false, "activation": "relu", "name": "block9_sepconv3_act", "dtype": "float32"}, "name": "block9_sepconv3_act"}, {"inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D", "config": {"bias_regularizer": null, "trainable": false, "padding": "same", "dtype": "float32", "activation": "linear", "depthwise_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last", "pointwise_regularizer": null, "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "use_bias": false, "pointwise_constraint": null, "depthwise_constraint": null, "kernel_size": [3, 3], "filters": 728, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}, "name": "block9_sepconv3"}, "name": "block9_sepconv3"}, {"inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "dtype": "float32", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": false, "center": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "block9_sepconv3_bn", "momentum": 0.99, "gamma_constraint": null, "gamma_regularizer": null, "axis": [3], "epsilon": 0.001}, "name": 